import './PrivacyPolicyPage.scss';

export default function PrivacyPolicyPage() {
  return (
    <div className="page-static">
      <div className="page-static__wrap privacy">
        <section className='privacy__title'>
          <h1>개인정보처리방침</h1>
          <p className="last-updated">최종 개정일: 2026년 1월 1일</p>
        </section>
        
        <section>
          <h2>1. 개인정보의 처리 목적</h2>
          <p>
            "회사"는 개인정보를 다음의 목적을 위해 처리하며, 다음 목적 이외의 용도로는 사용하지 않습니다.<br/>
            &nbsp;&nbsp;가. 서비스 제공: 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다.<br/>
            &nbsp;&nbsp;나. 회원 관리: 회원제 서비스 이용에 따른 본인확인, 개인식별, 부정 이용 방지, 비인가 사용 방지,
            가입의사 확인, 만14세 미만 아동 개인정보 수집 시 법정대리인 동의여부 확인,
            각종 고지·통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
          </p>
        </section>
        
        <section>
          <h2>2. 개인정보의 수집 항목 및 방법</h2>
          <p>
            "회사"는 다음의 개인정보 항목을 처리하고 있습니다.<br/>
            &nbsp;&nbsp;가. 수집 항목: 이름, 아이디, 비밀번호, 이메일 주소, 휴대전화번호, 성별, 생년월일 등<br/>
            &nbsp;&nbsp;나. 수집 방법: 웹사이트 회원가입, 서비스 이용 과정에서 생성되는 정보 수집 툴을 통한 수집
          </p>
        </section>
        
        <section>
          <h2>3. 개인정보의 처리 및 보유 기간</h2>
          <p>
            "회사"는 법령에 따른 개인정보 보유·이용 기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유·이용 기간 내에서
            개인정보를 처리 및 보유합니다.<br/>
            &nbsp;&nbsp;가. 회원 가입 및 관리: 서비스 이용계약 해지 시까지<br/>
            &nbsp;&nbsp;나. 재화 또는 서비스 제공: 재화·서비스 공급완료 및 요금결제·정산 완료 시까지
          </p>
        </section>
        
        <section>
          <h2>4. 개인정보의 제3자 제공</h2>
          <p>
            "회사"는 정보주체의 개인정보를 개인정보의 처리 목적에서 명시한 범위 내에서만 처리하며,
            정보주체의 동의, 법률의 특별한 규정 등 「개인정보 보호법」이 허용하는 경우에만 개인정보를 제3자에게 제공합니다.
          </p>
        </section>
        
        <section>
          <h2>5. 개인정보의 파기 절차 및 방법</h2>
          <p>
            "회사"는 개인정보 보유기간의 경과, 처리목적 달성 시에는 지체없이 해당 개인정보를 파기합니다.<br/>
            파기 절차 및 방법은 다음과 같습니다.<br/>
            &nbsp;&nbsp;가. 파기 절차: 파기 사유가 발생한 개인정보를 선정하고, "회사"의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.<br/>
            &nbsp;&nbsp;나. 파기 방법: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용하며, 종이 문서에 기록된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
          </p>
        </section>
        
        <section>
          <h2>6. 정보주체와 법정대리인의 권리·의무 및 그 행사방법</h2>
          <p>
            정보주체는 "회사"에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.<br/>
            &nbsp;&nbsp;가. 개인정보 열람요구<br/>
            &nbsp;&nbsp;나. 오류 등이 있을 경우 정정 요구<br/>
            &nbsp;&nbsp;다. 삭제요구<br/>
            &nbsp;&nbsp;라. 처리정지 요구
          </p>
          <p>
            위 권리 행사는 「개인정보 보호법」 등 관계 법령에서 정하는 바에 따라 제한될 수 있습니다.
          </p>
        </section>
        
        <section>
          <h2>7. 개인정보 보호책임자</h2>
          <p>
            "회사"는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여
            아래와 같이 개인정보 보호책임자를 지정하고 있습니다.<br/><br/>
            <strong>
              &nbsp;&nbsp;명칭 : (주)Born2Eat 개인정보 보호팀<br/>
              &nbsp;&nbsp;직책 : 개인정보 보호책임자<br/>
              &nbsp;&nbsp;연락처: privacy@born2eat.com / 1588-XXXX
            </strong>
          </p>
        </section>
        
        <section>
          <h2>8. 개인정보 처리방침 변경</h2>
          <p>
            이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는
            변경사항의 시행 7일 전부터 웹사이트 공지사항을 통하여 고지할 것입니다.
          </p>
        </section>
        
      </div>
    </div>
  );
}